Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/demo/renesas/fpb_ra4e1/ftp_client_demo/keil/startup_ra4e1.S
#include "bsp_irq_cfg.h"

; Amount of memory (in bytes) allocated for Stack
; Tailor this value to your application needs
; <h> Stack Configuration
;   <o> Stack Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

Stack_Size      EQU     0x400;

                AREA    STACK, NOINIT, READWRITE, ALIGN=3
Stack_Mem       SPACE   Stack_Size
__initial_sp


; <h> Heap Configuration
;   <o>  Heap Size (in Bytes) <0x0-0xFFFFFFFF:8>
; </h>

;Heap_Size      EQU     0x200;

;                AREA    HEAP, NOINIT, READWRITE, ALIGN=3
;__heap_base
;Heap_Mem        SPACE   Heap_Size
;__heap_limit

                PRESERVE8
                THUMB


; Vector Table Mapped to Address 0 at Reset
                AREA    RESET, DATA, READONLY
                EXPORT  __Vectors
                EXPORT  __Vectors_End
                EXPORT  __Vectors_Size
                EXPORT  __Options

__Vectors       DCD     __initial_sp               ; Top of Stack
                DCD     Reset_Handler              ; Reset Handler
                DCD     NMI_Handler                ; NMI Handler
                DCD     HardFault_Handler          ; Hard Fault Handler
                DCD     MemManage_Handler          ; MPU Fault Handler
                DCD     BusFault_Handler           ; Bus Fault Handler
                DCD     UsageFault_Handler         ; Usage Fault Handler
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     0                          ; Reserved
                DCD     SVC_Handler                ; SVCall Handler
                DCD     DebugMon_Handler           ; Debug Monitor Handler
                DCD     0                          ; Reserved
                DCD     PendSV_Handler             ; PendSV Handler
                DCD     SysTick_Handler            ; SysTick Handler

                ; External Interrupts
                IF      BSP_IRQ_CFG_ICU_IRQ0 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ1 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ2 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ3 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ3_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ4 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ4_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ5 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ5_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ6 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ6_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ7 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ7_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ8 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ8_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ9 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ9_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_IRQ13 != BSP_IRQ_DISABLED
                DCD     ICU_IRQ13_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC0_INT != BSP_IRQ_DISABLED
                DCD     DMAC0_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC1_INT != BSP_IRQ_DISABLED
                DCD     DMAC1_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC2_INT != BSP_IRQ_DISABLED
                DCD     DMAC2_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC3_INT != BSP_IRQ_DISABLED
                DCD     DMAC3_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC4_INT != BSP_IRQ_DISABLED
                DCD     DMAC4_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC5_INT != BSP_IRQ_DISABLED
                DCD     DMAC5_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC6_INT != BSP_IRQ_DISABLED
                DCD     DMAC6_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMAC7_INT != BSP_IRQ_DISABLED
                DCD     DMAC7_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DTC_COMPLETE != BSP_IRQ_DISABLED
                DCD     DTC_COMPLETE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DTC_END != BSP_IRQ_DISABLED
                DCD     DTC_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DMA_TRANSERR != BSP_IRQ_DISABLED
                DCD     DMA_TRANSERR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ICU_SNOOZE_CANCEL != BSP_IRQ_DISABLED
                DCD     ICU_SNOOZE_CANCEL_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_FCU_FIFERR != BSP_IRQ_DISABLED
                DCD     FCU_FIFERR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_FCU_FRDYI != BSP_IRQ_DISABLED
                DCD     FCU_FRDYI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_LVD_LVD1 != BSP_IRQ_DISABLED
                DCD     LVD_LVD1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_LVD_LVD2 != BSP_IRQ_DISABLED
                DCD     LVD_LVD2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CGC_MOSC_STOP != BSP_IRQ_DISABLED
                DCD     CGC_MOSC_STOP_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_LPM_SNOOZE_REQUEST != BSP_IRQ_DISABLED
                DCD     LPM_SNOOZE_REQUEST_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT0_INT != BSP_IRQ_DISABLED
                DCD     AGT0_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT0_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT0_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT0_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT0_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT1_INT != BSP_IRQ_DISABLED
                DCD     AGT1_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT1_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT1_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT1_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT1_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT2_INT != BSP_IRQ_DISABLED
                DCD     AGT2_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT2_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT2_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT2_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT2_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT3_INT != BSP_IRQ_DISABLED
                DCD     AGT3_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT3_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT3_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT3_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT3_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT5_INT != BSP_IRQ_DISABLED
                DCD     AGT5_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT5_COMPARE_A != BSP_IRQ_DISABLED
                DCD     AGT5_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_AGT5_COMPARE_B != BSP_IRQ_DISABLED
                DCD     AGT5_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IWDT_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     IWDT_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_WDT_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     WDT_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_RTC_ALARM != BSP_IRQ_DISABLED
                DCD     RTC_ALARM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_RTC_PERIOD != BSP_IRQ_DISABLED
                DCD     RTC_PERIOD_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_RTC_CARRY != BSP_IRQ_DISABLED
                DCD     RTC_CARRY_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_FIFO_0 != BSP_IRQ_DISABLED
                DCD     USBFS_FIFO_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_FIFO_1 != BSP_IRQ_DISABLED
                DCD     USBFS_FIFO_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_INT != BSP_IRQ_DISABLED
                DCD     USBFS_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_USBFS_RESUME != BSP_IRQ_DISABLED
                DCD     USBFS_RESUME_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_RXI != BSP_IRQ_DISABLED
                DCD     IIC0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_TXI != BSP_IRQ_DISABLED
                DCD     IIC0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_TEI != BSP_IRQ_DISABLED
                DCD     IIC0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_ERI != BSP_IRQ_DISABLED
                DCD     IIC0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IIC0_WUI != BSP_IRQ_DISABLED
                DCD     IIC0_WUI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAC_FREQUENCY_ERROR != BSP_IRQ_DISABLED
                DCD     CAC_FREQUENCY_ERROR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAC_MEASUREMENT_END != BSP_IRQ_DISABLED
                DCD     CAC_MEASUREMENT_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAC_OVERFLOW != BSP_IRQ_DISABLED
                DCD     CAC_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_ERROR != BSP_IRQ_DISABLED
                DCD     CAN0_ERROR_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_FIFO_RX != BSP_IRQ_DISABLED
                DCD     CAN0_FIFO_RX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_FIFO_TX != BSP_IRQ_DISABLED
                DCD     CAN0_FIFO_TX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_MAILBOX_RX != BSP_IRQ_DISABLED
                DCD     CAN0_MAILBOX_RX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_CAN0_MAILBOX_TX != BSP_IRQ_DISABLED
                DCD     CAN0_MAILBOX_TX_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_1 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_2 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_2_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_3 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_3_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_IOPORT_EVENT_4 != BSP_IRQ_DISABLED
                DCD     IOPORT_EVENT_4_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ELC_SOFTWARE_EVENT_0 != BSP_IRQ_DISABLED
                DCD     ELC_SOFTWARE_EVENT_0_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ELC_SOFTWARE_EVENT_1 != BSP_IRQ_DISABLED
                DCD     ELC_SOFTWARE_EVENT_1_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG0_EVENT != BSP_IRQ_DISABLED
                DCD     POEG0_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG1_EVENT != BSP_IRQ_DISABLED
                DCD     POEG1_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG2_EVENT != BSP_IRQ_DISABLED
                DCD     POEG2_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_POEG3_EVENT != BSP_IRQ_DISABLED
                DCD     POEG3_EVENT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT1_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT1_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT1_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT1_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT1_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT1_PC != BSP_IRQ_DISABLED
                DCD     GPT1_PC_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT2_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT2_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT2_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT2_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT2_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT2_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT4_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT4_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT4_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT4_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT4_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT4_PC != BSP_IRQ_DISABLED
                DCD     GPT4_PC_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_CAPTURE_COMPARE_A != BSP_IRQ_DISABLED
                DCD     GPT5_CAPTURE_COMPARE_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_CAPTURE_COMPARE_B != BSP_IRQ_DISABLED
                DCD     GPT5_CAPTURE_COMPARE_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_C != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_C_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_D != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_D_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_E != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_E_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COMPARE_F != BSP_IRQ_DISABLED
                DCD     GPT5_COMPARE_F_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COUNTER_OVERFLOW != BSP_IRQ_DISABLED
                DCD     GPT5_COUNTER_OVERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_COUNTER_UNDERFLOW != BSP_IRQ_DISABLED
                DCD     GPT5_COUNTER_UNDERFLOW_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_GPT5_PC != BSP_IRQ_DISABLED
                DCD     GPT5_PC_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_SCAN_END != BSP_IRQ_DISABLED
                DCD     ADC0_SCAN_END_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_SCAN_END_B != BSP_IRQ_DISABLED
                DCD     ADC0_SCAN_END_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_WINDOW_A != BSP_IRQ_DISABLED
                DCD     ADC0_WINDOW_A_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_WINDOW_B != BSP_IRQ_DISABLED
                DCD     ADC0_WINDOW_B_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_COMPARE_MATCH != BSP_IRQ_DISABLED
                DCD     ADC0_COMPARE_MATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_ADC0_COMPARE_MISMATCH != BSP_IRQ_DISABLED
                DCD     ADC0_COMPARE_MISMATCH_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_RXI != BSP_IRQ_DISABLED
                DCD     SCI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_TXI != BSP_IRQ_DISABLED
                DCD     SCI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_TEI != BSP_IRQ_DISABLED
                DCD     SCI0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_ERI != BSP_IRQ_DISABLED
                DCD     SCI0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_AM != BSP_IRQ_DISABLED
                DCD     SCI0_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI0_RXI_OR_ERI != BSP_IRQ_DISABLED
                DCD     SCI0_RXI_OR_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_RXI != BSP_IRQ_DISABLED
                DCD     SCI3_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_TXI != BSP_IRQ_DISABLED
                DCD     SCI3_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_TEI != BSP_IRQ_DISABLED
                DCD     SCI3_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_ERI != BSP_IRQ_DISABLED
                DCD     SCI3_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI3_AM != BSP_IRQ_DISABLED
                DCD     SCI3_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_RXI != BSP_IRQ_DISABLED
                DCD     SCI4_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_TXI != BSP_IRQ_DISABLED
                DCD     SCI4_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_TEI != BSP_IRQ_DISABLED
                DCD     SCI4_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_ERI != BSP_IRQ_DISABLED
                DCD     SCI4_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI4_AM != BSP_IRQ_DISABLED
                DCD     SCI4_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_RXI != BSP_IRQ_DISABLED
                DCD     SCI9_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_TXI != BSP_IRQ_DISABLED
                DCD     SCI9_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_TEI != BSP_IRQ_DISABLED
                DCD     SCI9_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_ERI != BSP_IRQ_DISABLED
                DCD     SCI9_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SCI9_AM != BSP_IRQ_DISABLED
                DCD     SCI9_AM_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_RXI != BSP_IRQ_DISABLED
                DCD     SPI0_RXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_TXI != BSP_IRQ_DISABLED
                DCD     SPI0_TXI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_IDLE != BSP_IRQ_DISABLED
                DCD     SPI0_IDLE_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_ERI != BSP_IRQ_DISABLED
                DCD     SPI0_ERI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_SPI0_TEI != BSP_IRQ_DISABLED
                DCD     SPI0_TEI_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_QSPI_INT != BSP_IRQ_DISABLED
                DCD     QSPI_INT_IRQHandler
                ENDIF
                IF      BSP_IRQ_CFG_DOC_INT != BSP_IRQ_DISABLED
                DCD     DOC_INT_IRQHandler
                ENDIF
__Vectors_End

__Vectors_Size  EQU  __Vectors_End - __Vectors

                FILL    (0x400 - __Vectors_Size), 0xFFFFFFFF, 4

__Options       FILL    0x100, 0xFFFFFFFF, 4

                AREA    |.text|, CODE, READONLY

